use mogoroomdb;

-- --BillTypeEnum-- --
DELETE FROM acct.acct_billtype;
INSERT INTO acct.acct_billtype( billType, billName, status, sort) VALUES
(1001, '充值账单,对应旧业务类型224001,3001,411001', 1, 1)
, (1002, '支付定金,对应旧业务类型216001', 1, 2)
, (1003, '租客支付首期款房租账单,对应旧业务类型216002', 1, 3)
, (1004, '租客支付常规款房租账单,对应旧业务类型216003', 1, 4)
, (1005, '租客支付水电煤账单,对应旧业务类型216004', 1, 5)
, (1006, '退款账单,对应旧业务类型3007,3008', 1, 6)
, (1007, '房东赔违约金,对应旧业务类型3009', 1, 7)
, (1008, '房东买回房租,对应旧业务类型3015', 1, 8)
, (1009, '公司租金贷款给房东,对应旧业务类型111002', 1, 9)
, (1010, '白条账单,白条账单', 1, 10)
, (1011, '房东保证金充值,对应旧业务类型3003,311002', 1, 11)
, (1012, '转账账单,对应旧业务类型311003', 1, 12)
, (10001, '逾期手续费,对应旧业务类型3013', 1, 13)
, (10002, '租客支付尾款账单,租客支付尾款账单', 1, 14)
, (10003, '蘑菇宝常规款房租账单,蘑菇宝常规款房租账单', 1, 15)
, (10004, '退房账单,退房账单', 1, 16)
;

-- 导入滞纳金费率
UPDATE  acct.acct_billtype 
SET penaltyRate=(SELECT penaltyRate FROM loan_landlord_type WHERE id=1)
WHERE 
billType=1008 -- 房东买回房租账单
AND EXISTS (SELECT * FROM loan_landlord_type WHERE id=1);
