/* Database name `mogo_da` ,创建hadoop 上线需要的表*/

USE `mogo_da`;

insert  into `user_renter_app_action_rule`(`id`,`sysId`,`pageActionId`,`pageAction`,`module`) values 
(1,'mogo-renter-app','F_0001->F_0009->F_0011->F_0008->F_0008_T_0007','首页->品牌页面->品牌个人首页->房间详情->预约界面','品牌找房路径统计'),
(2,'mogo-renter-app','F_0001->F_0009->F_0011->F_0008->F_0008_T_0008','首页->品牌页面->品牌个人首页->房间详情->预订界面','品牌找房路径统计'),
(3,'mogo-renter-app','F_0001->F_0009->F_0011->F_0012->F_0008->F_0008_T_0007','首页->品牌页面->品牌个人首页->品牌下所有房源->房间详情->预约界面','品牌找房路径统计'),
(4,'mogo-renter-app','F_0001->F_0009->F_0011->F_0012->F_0008->F_0008_T_0008','首页->品牌页面->品牌个人首页->品牌下所有房源->房间详情->预订界面','品牌找房路径统计'),
(5,'mogo-renter-app','F_0001->F_0009->F_0009_T_0005->F_0011->F_0012->F_0008->F_0008_T_0007','首页->品牌页面->品牌推荐->品牌个人首页->品牌下所有房源->房间详情->预约界面','品牌找房路径统计'),
(6,'mogo-renter-app','F_0001->F_0009->F_0009_T_0005->F_0011->F_0012->F_0008->F_0008_T_0008','首页->品牌页面->品牌推荐->品牌个人首页->品牌下所有房源->房间详情->预订界面','品牌找房路径统计'),
(7,'mogo-renter-app','F_0001->F_0009->F_0009_T_0005->F_0011->F_0008->F_0008_T_0007','首页->品牌页面->品牌推荐->品牌个人首页->房间详情->预约界面','品牌找房路径统计'),
(8,'mogo-renter-app','F_0001->F_0009->F_0009_T_0005->F_0011->F_0008->F_0008_T_0008','首页->品牌页面->品牌推荐->品牌个人首页->房间详情->预订界面','品牌找房路径统计'),
(9,'mogo-renter-app','F_0001->F_0003->F_0008->F_0008_T_0007','首页->合租找房->房间详情->预约界面','合租/整租找房路径统计'),
(10,'mogo-renter-app','F_0001->F_0003->F_0008->F_0008_T_0008','首页->合租找房->房间详情->预订界面','合租/整租找房路径统计'),
(11,'mogo-renter-app','F_0001->F_0014->F_0008->F_0008_T_0007','首页->整租找房->房间详情->预约界面','合租/整租找房路径统计'),
(12,'mogo-renter-app','F_0001->F_0014->F_0008->F_0008_T_0008','首页->整租找房->房间详情->预订界面','合租/整租找房路径统计'),
(13,'mogo-renter-app','F_0001->F_0004->F_0005->F_0008->F_0008_T_0007','首页->通勤找房->通勤找房列表->房间详情->预约界面','通勤找房页面'),
(14,'mogo-renter-app','F_0001->F_0004->F_0005->F_0008->F_0008_T_0008','首页->通勤找房->通勤找房列表->房间详情->预订界面','通勤找房页面'),
(15,'mogo-renter-app','F_0001->F_0006->F_0007->F_0008->F_0008_T_0007','首页->附近找房->附近地图->房间详情->预约界面','附近找房路径统计'),
(16,'mogo-renter-app','F_0001->F_0006->F_0007->F_0008->F_0008_T_0008','首页->附近找房->附近地图->房间详情->预订界面','附近找房路径统计'),
(17,'mogo-renter-app','F_0001->F_0006->F_0008->F_0008_T_0007','首页->附近找房->房间详情->预约界面','附近找房路径统计'),
(18,'mogo-renter-app','F_0001->F_0006->F_0008->F_0008_T_0008','首页->附近找房->房间详情->预订界面','附近找房路径统计'),
(19,'mogo-renter-app','F_0001->F_0001_T_0010->F_0011->F_0008->F_0008_T_0007','首页->优惠专题->品牌个人首页->房间详情->预约界面','优惠专题路径统计'),
(20,'mogo-renter-app','F_0001->F_0001_T_0010->F_0011->F_0008->F_0008_T_0008','首页->优惠专题->品牌个人首页->房间详情->预订界面','优惠专题路径统计'),
(21,'mogo-renter-app','F_0001->F_0001_T_0010->F_0008->F_0008_T_0007','首页->优惠专题->房间详情->预约界面','优惠专题路径统计'),
(22,'mogo-renter-app','F_0001->F_0001_T_0010->F_0008->F_0008_T_0008','首页->优惠专题->房间详情->预订界面','优惠专题路径统计'),
(23,'mogo-renter-app','F_0001->F_0017->F_0008->F_0008_T_0007','首页->搜索找房->房间详情->预约界面','搜索框页面路径统计'),
(24,'mogo-renter-app','F_0001->F_0017->F_0008->F_0008_T_0008','首页->搜索找房->房间详情->预订界面','搜索框页面路径统计'),
(25,'mogo-renter-app','F_0001->F_0001_T_0010->F_0011->F_0008->F_0008_T_0007','首页->专题详情->品牌个人首页->房间详情->预约界面','banner路径统计'),
(26,'mogo-renter-app','F_0001->F_0001_T_0010->F_0011->F_0008->F_0008_T_0008','首页->专题详情->品牌个人首页->房间详情->预订界面','banner路径统计'),
(27,'mogo-renter-app','F_0001->F_0001_T_0010->F_0008->F_0008_T_0007','首页->专题详情->房间详情->预约界面','banner路径统计'),
(28,'mogo-renter-app','F_0001->F_0001_T_0010->F_0008->F_0008_T_0008','首页->专题详情->房间详情->预订界面','banner路径统计');

/*Data for the table `user_renter_portrait_dictionary` */

insert  into `user_renter_portrait_dictionary`(`id`,`busicode`,`busiName`,`timinal`,`sort`,`status`) values 
(1,'F_0001','首页',1,1,1),
(2,'F_0001_T_0001','首页搜索框',1,1,1),
(3,'F_0001_T_0002','首页城市切换',1,1,1),
(4,'F_0001_T_0003','首页baner位',1,1,1),
(5,'F_0001_T_0004','首页底部首页Tab',1,1,1),
(6,'F_0001_T_0005','首页底部心愿Tab',1,1,1),
(7,'F_0001_T_0006','首页底部我Tab',1,1,1),
(8,'F_0001_T_0007','首页品牌专区',1,1,1),
(9,'F_0001_T_0008','首页合租找房',1,1,1),
(10,'F_0001_T_0009','首页整租找房',1,1,1),
(11,'F_0001_T_0010','首页优惠专题',1,1,1),
(12,'F_0001_T_0011','首页通勤找房',1,1,1),
(13,'F_0001_T_0012','首页附近找房',1,1,1),
(14,'F_0001_T_0013','首页优选品牌查看全部',1,1,1),
(15,'F_0001_T_0014','首页优选品牌图片入口',1,1,1),
(16,'F_0001_T_0015','首页推荐主题点击',1,1,1),
(17,'F_0001_T_0016','首页服务切换入口',1,1,1),
(18,'F_0002','心愿',1,1,1),
(19,'F_0002_T_0001','心愿列表房源推荐入口',1,1,1),
(20,'F_0002_T_0002','心愿列表最近拨号入口',1,1,1),
(21,'F_0002_T_0003','心愿列表收藏房源入口',1,1,1),
(22,'F_0002_T_0004','心愿列表浏览记录入口',1,1,1),
(23,'F_0002_T_0005','心愿列表Tab首页',1,1,1),
(24,'F_0002_T_0006','心愿列表Tab个人中心',1,1,1),
(25,'F_0003','合租找房',1,1,1),
(26,'F_0003_T_0001','合租列表搜索',1,1,1),
(27,'F_0003_T_0002','合租列表区域',1,1,1),
(28,'F_0003_T_0003','合租列表价格',1,1,1),
(29,'F_0003_T_0004','合租列表推荐排序',1,1,1),
(30,'F_0003_T_0005','合租列表高级筛选',1,1,1),
(31,'F_0004','通勤找房',1,1,1),
(32,'F_0004_T_0001','通勤找房当前位置',1,1,1),
(33,'F_0004_T_0002','通勤找房通勤时长',1,1,1),
(34,'F_0005','通勤找房列表',1,1,1),
(35,'F_0005_T_0001','通勤找房列表区域',1,1,1),
(36,'F_0005_T_0002','通勤找房列表价格',1,1,1),
(37,'F_0005_T_0003','通勤找房列表推荐排序',1,1,1),
(38,'F_0005_T_0004','通勤找房列表高级筛选',1,1,1),
(39,'F_0005_T_0005','通勤找房列表通勤大约时长',1,1,1),
(40,'F_0006','附近找房',1,1,1),
(41,'F_0006_T_0001','附近找房搜索',1,1,1),
(42,'F_0006_T_0002','附近找房地图切换',1,1,1),
(43,'F_0006_T_0003','附近找房距离',1,1,1),
(44,'F_0006_T_0004','附近找房价格',1,1,1),
(45,'F_0006_T_0005','附近找房推荐排序',1,1,1),
(46,'F_0006_T_0006','附近找房高级筛选',1,1,1),
(47,'F_0007','地图找房',1,1,1),
(48,'F_0007_T_0001','地图找房高级筛选',1,1,1),
(49,'F_0007_T_0002','地图找房坐标显示切换',1,1,1),
(50,'F_0007_T_0003','地图找当前位置房',1,1,1),
(51,'F_0007_T_0004','地图找房距离',1,1,1),
(52,'F_0008','房间详情',1,1,1),
(53,'F_0008_T_0001','房间详情分享',1,1,1),
(54,'F_0008_T_0002','房间详情首期款明细',1,1,1),
(55,'F_0008_T_0003','房间详情品牌主页入口',1,1,1),
(56,'F_0008_T_0004','房间详情其他房间信息',1,1,1),
(57,'F_0008_T_0005','房间详情相似房源入口',1,1,1),
(58,'F_0008_T_0006','房间详情联系房东',1,1,1),
(59,'F_0008_T_0007','房间详情预约',1,1,1),
(60,'F_0008_T_0008','房间详情预定',1,1,1),
(61,'F_0009','品牌首页',1,1,1),
(62,'F_0009_T_0001','品牌首页Banner',1,1,1),
(63,'F_0009_T_0002','品牌首页品牌入口',1,1,1),
(64,'F_0009_T_0003','品牌首页查看全部品牌',1,1,1),
(65,'F_0009_T_0004','品牌首页推荐品牌进入详情',1,1,1),
(66,'F_0009_T_0005','品牌首页查看主题',1,1,1),
(67,'F_0010','所有品牌',1,1,1),
(68,'F_0010_T_0001','所有品牌区域筛选',1,1,1),
(69,'F_0010_T_0002','所有品牌保障服务筛选',1,1,1),
(70,'F_0011','品牌详情',1,1,1),
(71,'F_0011_T_0001','品牌详情分享',1,1,1),
(72,'F_0011_T_0002','品牌详情展开更多',1,1,1),
(73,'F_0011_T_0003','品牌详情最近上线/官方评测',1,1,1),
(74,'F_0011_T_0004','品牌详情全部房源',1,1,1),
(75,'F_0012','品牌全部房源列表',1,1,1),
(76,'F_0012_T_0001','品牌全部房源列表搜索框',1,1,1),
(77,'F_0012_T_0002','品牌全部房源列表区域筛选',1,1,1),
(78,'F_0012_T_0003','品牌全部房源列表价格筛选',1,1,1),
(79,'F_0012_T_0004','品牌全部房源列表推荐排序',1,1,1),
(80,'F_0012_T_0005','品牌全部房源列表高级筛选',1,1,1),
(81,'F_0013','个人中心',1,1,1),
(82,'F_0013_T_0001','个人中心钱包',1,1,1),
(83,'F_0013_T_0002','个人中心消息',1,1,1),
(84,'F_0013_T_0003','个人中心我的订单',1,1,1),
(85,'F_0013_T_0004','个人中心我的账单',1,1,1),
(86,'F_0013_T_0005','个人中心售后服务',1,1,1),
(87,'F_0013_T_0006','个人中心系统设置',1,1,1),
(88,'F_0013_T_0007','个人中心头像',1,1,1),
(89,'F_0013_T_0008','个人中心Tab首页',1,1,1),
(90,'F_0013_T_0009','个人中心Tab心愿',1,1,1),
(91,'F_0014','整租找房',1,1,1),
(92,'F_0014_T_0001','整租找房搜索',1,1,1),
(93,'F_0014_T_0002','整租找房区域',1,1,1),
(94,'F_0014_T_0003','整租找房价格',1,1,1),
(95,'F_0014_T_0004','整租找房推荐排序',1,1,1),
(96,'F_0014_T_0005','整租找房高级筛选',1,1,1),
(97,'F_0016','快捷服务',1,1,1),
(98,'F_0016_T_0001','快捷服务头像',1,1,1),
(99,'F_0016_T_0002','快捷服务账单服务',1,1,1),
(100,'F_0016_T_0003','快捷服务订单服务',1,1,1),
(101,'F_0016_T_0004','快捷服务钱包',1,1,1),
(102,'F_0016_T_0005','快捷服务售后服务',1,1,1),
(103,'F_0017','搜索找房',1,1,1),
(104,'F_0017_T_0001','搜索找房搜索操作',1,1,1),
(105,'F_0017_T_0002','搜索找房区域',1,1,1),
(106,'F_0017_T_0003','搜索找房价格',1,1,1),
(107,'F_0017_T_0004','搜索找房推荐排序',1,1,1),
(108,'F_0017_T_0005','搜索找房高级筛选',1,1,1),
(109,'F_0018','路程',1,1,1),
(110,'F_0018_T_0001','路程更多新路线',1,1,1),
(111,'F_0018_T_0002','路程切换交通方式',1,1,1),
(112,'O_0001','启动App',1,1,1),
(113,'C_0001','关闭App',1,10,1),
(114,'K_0001','后台App',1,1,1),
(115,'F_0019','推荐房源列表',1,1,1),
(116,'F_0020','最近拨号列表',1,1,1),
(117,'F_0021','收藏列表',1,1,1),
(118,'F_0022','浏览记录列表',1,1,1),
(119,'T_9998','密码登录',1,1,1),
(120,'T_9998_T0001','语音验证码',1,1,1),
(121,'T_9998_T0002','密码登录',1,1,1),
(122,'T_9999','验证码登录',1,1,1),
(123,'T_9999_T0001','忘记密码',1,1,1),
(124,'T_9999_T0002','短信验证码',1,1,1),
(125,'F_0023','账单页面',1,1,1),
(126,'F_0023_T0001','单选',1,1,1),
(127,'F_0023_T0002','全选',1,1,1),
(128,'F_0023_T0003','全部账单',1,1,1),
(129,'F_0023_T0004','账单详情入口',1,1,1),
(130,'F_0024','订单页面',1,1,1),
(131,'F_0024_T0001','未签约订单',1,1,1),
(132,'F_0024_T0002','已签约订单',1,1,1),
(133,'F_0024_T0003','订单详情入口',1,1,1),
(134,'F_0024_T0004','合同入口',1,1,1),
(135,'F_0025','账单详情界面',1,1,1),
(136,'F_0026','订单详情界面',1,1,1);
