/* Database name `mogoroomdb`，更换租客消息模版类型（businessType字段） */

use mogoroomdb;

/* 账号服务 */
update mesg_templet set businessType=21 
where id in (55,56,57,58,59,79,83,84,88,89,90,105,106,112,113,114,125,
	126,148,161,169,170,234,235,237,238,239,240,248,249,250,251,252,253,
	254,255,263,264,279,282,283);

/* 账单服务 */
update mesg_templet set businessType=22 
where id in (71,72,73,74,75,76,77,78,95,96,97,98,121,122,152,153,155,
	156,164,165,171,173,174,176,177,201);

/* 租约服务 */
update mesg_templet set businessType=23 
where id in (61,62,67,68,69,70,91,92,93,94,99,100,102,103,107,108,109,
	110,111,119,120,123,124,127,128,129,130,131,132,133,134,135,141,143,
	178,180,199,208,209,210,211,212,214,217,280,281);

/* 售后服务 */
update mesg_templet set businessType=24 
where id in (80,81,82,85,86,87,322);
